# GetRoofVertices

## Description
Function GetRoofVertices returns the number of roof edges in the referenced roof object.

```pascal
FUNCTION GetRoofVertices(roofObject : HANDLE): INTEGER;
```

```python
def vs.GetRoofVertices(roofObject):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|roofObject|HANDLE|Handle to roof.|

## Version
Availability: from VectorWorks8.0

## Category
* Objects - Roofs